[
    {
        "post_text": "Everyone talks about HR not getting back to you.\n\nBut no one talks about those relatives who took our resumes and CVs saying \"Tu tension mat le, main baat karta hun kisi se.\" and then never showed up ever again. 🥲",
        "engagement": 1426,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Career",
            "Job Search"
        ]
    },
    {
        "post_text": "Colleague - You are exhausted, Smriti. It’s ok. Weekend pe rest kar lena.\n\nMe - Weekend pe rest?? HehehHAHAHHA! The way life has been going, I need to hibernate for at least 6 months straight! 😀👍",
        "engagement": 368,
        "line_count": 2,
        "language": "Hinglish",
        "tags": [
            "Mental Health",
            "Work Life Balance"
        ]
    },
    {
        "post_text": "To all these quick commerce brands, (To be specific, Everyday, Zepto Café, etc.)\n\nI know you guys are trying to make our lives as convenient as possible by offering services that, tbh, leave us partially(totally) disappointed.\n\nYaar dekho, ek real incident share karti hun...",
        "engagement": 229,
        "line_count": 5,
        "language": "Hinglish",
        "tags": [
            "Customer Experience",
            "Commerce"
        ]
    },
    {
        "post_text": "Do Swiggy employees ever order from Zomato and deliberately give bad ratings, and vice versa? 😀",
        "engagement": 500,
        "line_count": 1,
        "language": "English",
        "tags": [
            "Food Delivery"
        ]
    },
    {
        "post_text": "Just when I think people from Bangalore can't surprise me anymore, someone walks in and does something beyond my wildest imagination!\n\nSo, this one guy delivered himself to his office using PORTER??? because he couldn't find a cab on Ola or Uber!!!?????? AYYOOOOOOO!!!!\n\nJust Bangalore things!!! T_T",
        "engagement": 2692,
        "line_count": 4,
        "language": "English",
        "tags": [
            "Location",
            "Innovation"
        ]
    },
    {
        "post_text": "Resume ka ATS-Friendly hona is as important as shahi paneer mein paneer ka hona. 🙂👍",
        "engagement": 485,
        "line_count": 1,
        "language": "Hinglish",
        "tags": [
            "Job Search"
        ]
    },
    {
        "post_text": "Either you're a chill manager, or you're an all-the-time \"chillane wala\" manager. There's no middle ground. 🙂👍",
        "engagement": 575,
        "line_count": 1,
        "language": "Hinglish",
        "tags": [
            "Leadership"
        ]
    },
    {
        "post_text": "It takes a special kind of person to type \"Please find attached\" and then forget to attach the file. That person is me. EVERY. SINGLE. TIME! 🤡",
        "engagement": 445,
        "line_count": 2,
        "language": "English",
        "tags": [
            "Humor",
            "Productivity"
        ]
    },
    {
        "post_text": "Nahin Sir!\n\nYou can’t give me a task at 5:30 and expect it to be done by EOD.\n\nI SWEAR I’LL CRY!!",
        "engagement": 692,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Work Life Balance",
            "Productivity"
        ]
    },
    {
        "post_text": "What a scam!\n\nPura hafta weekend ka wait karo aur yeh weekend do second bhi nahin tikta. 😡",
        "engagement": 561,
        "line_count": 2,
        "language": "Hinglish",
        "tags": [
            "Scams",
            "Work Life Balance"
        ]
    },
    {
        "post_text": "Dear Boss,\n\nI don’t know if you believe in this or not but employees ki productivity appreciation se badhti hai, naa ki criticism se.\n\nThanks and regards 👺🎀",
        "engagement": 2445,
        "line_count": 3,
        "language": "Hinglish",
        "tags": [
            "Employee Appreciation",
            "Productivity"
        ]
    },
    {
        "post_text": "Office mein, the one with a MacBook has way less work than the one with a Dell or ThinkPad.",
        "engagement": 1787,
        "line_count": 1,
        "language": "Hinglish",
        "tags": [
            "Work Life Balance",
            "Technology"
        ]
    },
    {
        "post_text": "See,\n\nNo matter how much I rant on LinkedIn about my corporate life, deep down, I am forever grateful to God and my parents for making me capable enough to secure a job in the corporate sector. I’m thankful for everything that worked in my favor and for the people who gave me experiences worth sharing on this platform—experiences that often make others wonder what’s wrong with my brain.",
        "engagement": 484,
        "line_count": 2,
        "language": "English",
        "tags": [
            "Corporate Life",
            "Motivation"
        ]
    },
    {
        "post_text": "Yeh haseen waadiyaan, yeh khula aasmaan\n\nYet, you all decided to create official WhatsApp groups just to send unnecessary meeting invites and messages that look like emails! 😡",
        "engagement": 556,
        "line_count": 2,
        "language": "Hinglish",
        "tags": [
            "Corporate Life",
            "Productivity"
        ]
    },
    {
        "post_text": "Words that I swear by\n\nYour personal life should remain private and unknown to anyone in the office. What you do after office hours, who you meet, where you go, when your next vacation is planned, who you’re dating, or what you’re planning for the weekend—everything should be kept to yourself.\n\nYou never know who might be plotting against you.\n\nAs they say, \"Prevention is better than cure.\"",
        "engagement": 1469,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Career Advice",
            "Productivity"
        ]
    }
]